from django.template.defaultfilters import slugify as django_slugify

alphabet = {
    'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i',
    'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
    'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'shch', 'ы': 'i', 'э': 'e', 'ю': 'yu',
    'я': 'ya', "ա": "a", "բ": "b", "գ": "g", "դ": "d", "ե": "e", "զ": "z", "է": "e", "ը": "y", "թ": "t", "ժ": "j", "ի": "i", "լ": "l", "խ": "kh",
    "ծ": "ts", "կ": "k", "հ": "h", "ձ": "dz", "ղ": "x", "ճ": "tch", "մ": "m", "յ": "y", "ն": "n", "շ": "sh", "ո": "vo", "չ": "ch", "պ": "p",
    "ջ": "j", "ռ": "r", "ս": "s", "վ": "v", "տ": "t", "ր": "r", "ց": "c", "ու": "u", "փ": "p", "ք": "q", "և": "yev", "օ": "o", "ֆ": "f",
}


def slugify(s):
    return django_slugify(''.join(alphabet.get(w, w) for w in s.lower()))
